Laboratorio-de-Microprocesadores-2018/Mp3Player/board/pin_mux.c
    gpio_pin_config_t SD_DETECT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD7 (pin 100)  */
    GPIO_PinInit(BOARD_INITPINS_SD_DETECT_GPIO, BOARD_INITPINS_SD_DETECT_PIN, &SD_DETECT_config);

    /* PORTA12 (pin 42) is configured as I2S0_TXD0 */
    PORT_SetPinMux(BOARD_INITPINS_I2S_SDI_PORT, BOARD_INITPINS_I2S_SDI_PIN, kPORT_MuxAlt6);

    /* PORTA13 (pin 43) is configured as I2S0_TX_FS */
    PORT_SetPinMux(BOARD_INITPINS_I2S_WS_PORT, BOARD_INITPINS_I2S_WS_PIN, kPORT_MuxAlt6);

    /* PORTA14 (pin 44) is configured as PTA14 */
    PORT_SetPinMux(BOARD_INITPINS_HPR_SENSE_PORT, BOARD_INITPINS_HPR_SENSE_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTA14 (pin 44): Interrupt/DMA request is disabled */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_HPR_SENSE_PORT, BOARD_INITPINS_HPR_SENSE_PIN, kPORT_InterruptOrDMADisabled);

    /* PORTA15 (pin 45) is configured as PTA15 */
    PORT_SetPinMux(BOARD_INITPINS_HPL_SENSE_PORT, BOARD_INITPINS_HPL_SENSE_PIN, kPORT_MuxAsGpio);

    /* PORTA17 (pin 47) is configured as I2S0_MCLK */
    PORT_SetPinMux(BOARD_INITPINS_I2S_MCLK_PORT, BOARD_INITPINS_I2S_MCLK_PIN, kPORT_MuxAlt6);

    /* PORTA18 (pin 50) is configured as EXTAL0 */
    PORT_SetPinMux(BOARD_INITPINS_XTALP_PORT, BOARD_INITPINS_XTALP_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTA19 (pin 51) is configured as XTAL0 */
    PORT_SetPinMux(BOARD_INITPINS_XTALN_PORT, BOARD_INITPINS_XTALN_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTA4 (pin 38) is configured as NMI_b */
    PORT_SetPinMux(BOARD_INITPINS_NMI_PORT, BOARD_INITPINS_NMI_PIN, kPORT_MuxAlt7);

    /* PORTA5 (pin 39) is configured as I2S0_TX_BCLK */
    PORT_SetPinMux(BOARD_INITPINS_I2S_CLK_PORT, BOARD_INITPINS_I2S_CLK_PIN, kPORT_MuxAlt6);

    /* PORTB0 (pin 53) is configured as FTM1_QD_PHA */
    PORT_SetPinMux(BOARD_INITPINS_ENC_A_PORT, BOARD_INITPINS_ENC_A_PIN, kPORT_MuxAlt6);

    /* PORTB1 (pin 54) is configured as FTM1_QD_PHB */
    PORT_SetPinMux(BOARD_INITPINS_ENC_B_PORT, BOARD_INITPINS_ENC_B_PIN, kPORT_MuxAlt6);

    /* PORTB10 (pin 58) is configured as SPI1_PCS0 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_CSn_PORT, BOARD_INITPINS_LCD_CSn_PIN, kPORT_MuxAlt2);

    /* PORTB11 (pin 59) is configured as SPI1_SCK */
    PORT_SetPinMux(BOARD_INITPINS_LCD_SCK_PORT, BOARD_INITPINS_LCD_SCK_PIN, kPORT_MuxAlt2);

    /* PORTB16 (pin 62) is configured as SPI1_SOUT */
    PORT_SetPinMux(BOARD_INITPINS_LCD_MOSI_PORT, BOARD_INITPINS_LCD_MOSI_PIN, kPORT_MuxAlt2);

    /* PORTB17 (pin 63) is configured as SPI1_SIN */
    PORT_SetPinMux(BOARD_INITPINS_LCD_MISO_PORT, BOARD_INITPINS_LCD_MISO_PIN, kPORT_MuxAlt2);

    /* PORTB18 (pin 64) is configured as PTB18 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_RESET_PORT, BOARD_INITPINS_LCD_RESET_PIN, kPORT_MuxAsGpio);

    /* PORTB19 (pin 65) is configured as PTB19 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_DCRS_PORT, BOARD_INITPINS_LCD_DCRS_PIN, kPORT_MuxAsGpio);

    /* PORTB2 (pin 55) is configured as I2C0_SCL */
    PORT_SetPinMux(BOARD_INITPINS_AUD_I2C_SCL_PORT, BOARD_INITPINS_AUD_I2C_SCL_PIN, kPORT_MuxAlt2);

    /* PORTB20 (pin 66) is configured as PTB20 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_LED_PORT, BOARD_INITPINS_LCD_LED_PIN, kPORT_MuxAsGpio);

    /* PORTB22 (pin 68) is configured as SPI2_SOUT */
    PORT_SetPinMux(BOARD_INITPINS_LED_DATA_PORT, BOARD_INITPINS_LED_DATA_PIN, kPORT_MuxAlt2);

    /* PORTB23 (pin 69) is configured as PTB23 */
    PORT_SetPinMux(BOARD_INITPINS_BTN_MENU_PORT, BOARD_INITPINS_BTN_MENU_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[23] = ((PORTB->PCR[23] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_PFE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp)

                      /* Passive Filter Enable: Passive input filter is enabled on the corresponding pin, if the
                       * pin is configured as a digital input.
                       * Refer to the device data sheet for filter characteristics. */
                      | PORT_PCR_PFE(kPORT_PassiveFilterEnable));

    /* PORTB3 (pin 56) is configured as I2C0_SDA */
    PORT_SetPinMux(BOARD_INITPINS_AUD_I2C_SDA_PORT, BOARD_INITPINS_AUD_I2C_SDA_PIN, kPORT_MuxAlt2);

    /* PORTC0 (pin 70) is configured as PTC0 */
    PORT_SetPinMux(BOARD_INITPINS_BTN_NEXT_PORT, BOARD_INITPINS_BTN_NEXT_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[0] = ((PORTC->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_PFE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Passive Filter Enable: Passive input filter is enabled on the corresponding pin, if the
                      * pin is configured as a digital input.
                      * Refer to the device data sheet for filter characteristics. */
                     | PORT_PCR_PFE(kPORT_PassiveFilterEnable));

    /* PORTC1 (pin 71) is configured as LLWU_P6 */
    PORT_SetPinMux(BOARD_INITPINS_BTN_SELECT_PORT, BOARD_INITPINS_BTN_SELECT_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[1] = ((PORTC->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_PFE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Passive Filter Enable: Passive input filter is enabled on the corresponding pin, if the
                      * pin is configured as a digital input.
                      * Refer to the device data sheet for filter characteristics. */
                     | PORT_PCR_PFE(kPORT_PassiveFilterEnable));

    /* PORTC10 (pin 82) is configured as I2C1_SCL */
    PORT_SetPinMux(BOARD_INITPINS_BAT_I2C_SCL_PORT, BOARD_INITPINS_BAT_I2C_SCL_PIN, kPORT_MuxAlt2);

